# coding:utf8
"""
Модуль описывает тип-запись.
"""

if True:
	from пакКомпилер.пакСлово import тСлово
	from пакКомпилер.пакМодуль.пакТипы.модРод import тРод
	from пакКомпилер.пакМодуль.пакПоле.модПоле import тПоле

class тТипЗапись:
	def __init__(сам, пТип):
		сам.тип = пТип
		сам.__запись_поля = {} # все поля внутри записи
		сам.__Запись_Проверить()
		сам.__Поля_Проверить()

	def __Запись_Проверить(сам):
		"""
		Проверяет заголовок записи.
		Если есть предок -- заполняет предка.
		"""
		def Предок_Получ():
				строка_предок = сам.тип.Слово_Проверить()
				сам.тип.Тип_Уст(строка_предок)
				сам.тип.СловаСекции_Обрезать()
		def СловоЗапись_Получить():
			строка_запись = сам.тип.Слово_Проверить()
			if строка_запись != "RECORD":
				assert False, "тТипЗапись: пропущено ключевое слово RECORD? строка=\""+строка_запись+"\""
			сам.тип.СловаСекции_Обрезать()
		def СкобкаЛевая_Обрезать():
			"""
			В этой позиции может быть скобка, а может и нет. Надо проверять.
			"""
			бРезультат = False
			строка_скобка = сам.тип.Слово_Проверить()
			if строка_скобка == "(":
				бРезультат = True
				сам.тип.СловаСекции_Обрезать()
			return бРезультат
		def СкобкаПрав_Обрезать():
				строка_скобка = сам.тип.Слово_Проверить()
				if строка_скобка != ")": # закрытие имени предка
					assert False, "тТипЗапись: пропущена закрывающая скобка предка? строка=\""+строка_скобка+"\""
				сам.тип.СловаСекции_Обрезать()
		СловоЗапись_Получить()
		if СкобкаЛевая_Обрезать():
			Предок_Получ()
			СкобкаПрав_Обрезать()

	def __Поля_Проверить(сам):
		"""
		В записях ВСЕГДА встречается окончание "END" даже без
		вложенных полей.
		Поэтому здесь проверяем в цикле все поля, пока не закончатся
		"""
		строка_конец = сам.тип.Слово_Проверить()

		# если типы не встроенные (у встроенных типов нет полей)
		while строка_конец != "END": # нет окончания описания типа
			сам.тип.поля[len(сам.тип.поля)] = тПоле(сам.тип)
			строка_конец = сам.тип.Слово_Проверить()

		сам.тип.СловаСекции_Обрезать()
