# coding: utf8
"""
Модуль диспетчера событий.
Нужен для того, чтобы отвязать графику от логики
"""

import time as мВрем

class тДиспетчер:
	def __init__(сам, пОберон):
		сам.__оберон = пОберон
		сам.__файл_исх = ""

	def Старт(сам):
		сам.__конс = сам.__оберон.конс
		сам.__гуи = сам.__оберон.гуи
		сам.__окнГлав = сам.__гуи.окнГлав
		теги = ["MODULE", "IMPORT","CONST", "TYPE", "VAR", "PROCEDURE", "BEGIN", \
				"END", "FLOOR", "REAL", "INTEGER", "BOOLEAN", "RECORD", "POINTER", \
				"TO", "ARRAY", "OF", "CHAR", "RECORD"]
		сам.__окнГлав.рамкаСред.Теги_Добавить(теги)
		сам.__конс.Шапка_Печать()
		сам.__гуи.Пуск()

	def Исх_Открыть(сам,):
		сам.__оберон.конс.Отладить("тДиспетчер.Файл_Открыть()")
		from tkinter import filedialog as fd
		сам.__файл_исх = fd.askopenfilename(filetypes=(("Оберон файлы", "*.o7"),
													 ("Текстовые файлы", "*.txt;*.me"),
																("Все файлы", "*.*") ))
		if сам.__файл_исх != "":
			f = open(сам.__файл_исх, 'r', encoding='utf-8')
			сИсх = f.read()
			f.close()
			сам.__оберон.гуи.окнГлав.рамкаСред.текстКод.delete('1.0', 'end')
			сам.__оберон.гуи.окнГлав.рамкаСред.текстКод.insert("1.0", сИсх)

	def Приложение_Закрыть(сам, событие=None):
		print("тДиспетчер.Приложение_Закрыть()")
		import sys
		sys.exit()

	def Компилировать(сам):
		сам.__оберон.гуи.окнГлав.консоль.Очистить()
		сам.__оберон.конс.Шапка_Печать()
		стрИсх = сам.__оберон.гуи.окнГлав.рамкаСред.текстКод.get('1.0','end')
		стрИсх = стрИсх[:-1]
		f = open(сам.__файл_исх, 'w', encoding='utf-8')
		f.write(стрИсх)
		f.close()
		сам.__конс.Печать(сам.__оберон.рес.компиляция)
		from пакОберон.пакКомпилятор import тКомпилер
		врем_нач = мВрем.time()
		компилер = тКомпилер(сам.__оберон)
		компилер.Выполнить(сам.__файл_исх)

		врем_кон = мВрем.time()
		врем_дельта = врем_кон - врем_нач
		время = str(врем_дельта*1000)[0:7]
		стрВремя = "Время компиляции: " + время + " мс"
		сам.__конс.Печать(стрВремя)
