# coding: utf8
"""
Модуль предоставляющий окно справочной системы
"""

from tkinter import Toplevel as тОкно, Frame as тРамка, Button as тКнопка, \
		Text as тТекст

class тОкноСправка(тОкно):
	def __init__(сам, пОберон):
		тОкно.__init__(сам)
		сам.title("Справка по компилятору")
		сам.protocol("WM_DELETE_WINDOW",сам.Скрыть)
		сам.minsize(500,300)
		сам.withdraw()

		сам.рмкЛевая = тРамка(сам, border=2, relief='ridge')
		сам.рмкЛевая.pack(side='left', fill='y')

		сам.кнпОберон = тКнопка(сам.рмкЛевая, text = '0. Оберон', command=сам.стрОберон_Показать)
		сам.кнпОберон.pack(side='top')

		сам.рмкПравая = тРамка(сам, border=2, relief='ridge')
		сам.рмкПравая.pack(side='left', fill='both', expand=True)

		сам.редСправка = тТекст(сам.рмкПравая)
		сам.редСправка.pack(fill='both', expand=True)
		сам.редСправка.insert('end', 'Справочная система компилятора')

	def стрОберон_Показать(сам):
		стрОберон="""
	Справка по Оберону.
Этот текст появляется при показе справки по Оберону
		"""
		сам.редСправка.delete('1.0','end')
		сам.редСправка.insert('end', стрОберон)

	def Показать(сам):
		сам.deiconify()

	def Скрыть(сам):
		сам.withdraw()
